Revit 2024 API
GroupTypeId.EnergyAnalysisRoomSpaceData Property
 Room/Space Data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId EnergyAnalysisRoomSpaceData { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisRoomSpaceData As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisRoomSpaceData {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace